{
    "slug": "backend-developer",
    "name": "Mojtaba Akbarpour Khomami",
    "title": "Backend Developer",
    "contact": [
        {
            "value": "+989119351172",
            "link": "tel:+989119351172"
        },
        {
            "value": "mjeelm@gmail.com",
            "link": "mailto:mjeelm@gmail.com"
        },
        {
            "value": "My website returntrue.ir",
            "link": "https://returntrue.ir"
        }
    ],
    "social": [
        {
            "name": "github",
            "link": "https://github.com/mj999666/"
        },
        {
            "name": "linkedin",
            "link": "https://www.linkedin.com/in/mojtaba-akbarpour-89842b7b/"
        },
        {
            "name": "youtube",
            "link": "https://www.youtube.com/channel/UCS1L8yzwvLa-VqcFWUCFbMw"
        }
    ],
    "skills": [
        "Proficient in PHP programming language",
        "Skilled in Laravel framework",
        "Familiar with database management systems, including MySQL",
        "Experience in front-end development, including HTML, CSS, and JavaScript",
        "Knowledgeable in version control systems, including Git",
        "Familiar with agile methodologies, including Scrum",
        "Teaching and Mentorship",
        "Efficient learner"
    ],
    "about": "I am a skilled PHP developer with expertise in Laravel framework. I have worked on several projects where I was responsible for the backend development and database management. I have experience in developing solutions for e-commerce, including product management, categories, discounts, orders, pre-orders, and shipping costs. In addition to my technical skills, I also have a passion for mentoring junior developers and enjoy working as part of a team.",

    "workExperience" : [
        {
            "workAs" : "PHP Developer",
            "nameOfCompany" : "Shahrara" ,
            "companyLocation" : "Rasht, Gilan, Iran" ,
            "durationOfEmployment": "(2015 - Present)",
            "url": "https://shahrara.net",
            "description": "Shahrara Company is an active company in creating smart and creative solutions in the digital world. Using the latest technologies and its more than ten years of experience, the company aims to help various brands establish their presence by producing websites and apps.",
            "responsibilities" : [
                "Developed and maintained e-commerce websites using Laravel framework",
                "Created and managed databases using MySQL",
                "Collaborated with front-end developers to ensure seamless integration between front-end and back-end systems",
                "Developed APIs for mobile applications",
                "Implemented features such as product management, categories, discounts, orders and pre-orders, and shipping costs",
                "Created and maintained technical documentation"
            ]
        }
    ],
    "projects" : [
        {
            "title" : "Banan Bakery",
            "description": "Developed an e-commerce website for a bakery using Laravel framework. Implemented features such as product management, categories, discounts, orders and pre-orders, and shipping costs.",
            "url": "https://app.bananbakery.com/"
        },
        {
            "title" : "Rahnama Fish",
            "description": "Developed an e-commerce website for a seafood store using Laravel framework. Implemented features such as product management, categories, discounts, orders and pre-orders, and shipping costs.",
            "url": "https://app.rahnamafish.ir/"
        },
        {
            "title" : "Ninilos",
            "description": "Developed an e-commerce website for a children's clothing store using Laravel framework. Implemented features such as product management, categories, discounts, orders and pre-orders, and shipping costs.",
            "url": "https://ninilos.com/"
        }
    ],
    "otherProjects": "Other digital solutions for well-known brands: Worked on various projects for well-known brands, including Razeghi (<a href=\"https://webapp.razeghigroup.com/\" target=\"_new\">https://webapp.razeghigroup.com/</a>) is an app for ordering food from the Razeghi restaurant, Narenj (<a href=\"https://webapp.narenj.me/\" target=\"_new\">https://webapp.narenj.me/</a>) is an app designed as a marketplace for stores to showcase their products, and Dryvity (<a href=\"https://dryvity.ir/\" target=\"_new\">https://dryvity.ir/</a>) is a website for purchasing products such as pistachios, dried fruits, and more. Developed backend solutions using Laravel framework.",
    "educations" : [
        {
            "degree" : "Master's degree in Computer Science",
            "universityName" : "Payame Noor",
            "location" : "Iran - Gilan - Rasht",
            "graduationDate" : "2008-2012"
        }
    ],
    "certifications" : [
        {
            "title" : "Master's degree in Computer Science",
            "certificationAuthority" : "Payame Noor",
            "date" : "Iran - Gilan - Rasht"
        }
    ],
    "languages" : [
        {
            "title" : "English",
            "level" : "Fluent"
        },
        {
            "title" : "Persian/Farsi",
            "level" : "Native speaker"
        }
    ]
}
